Tekla Open API Reference for Tekla Structures 2025
BoltHoleAttributes.SlotOffsetY Property
 The slot offset Y value.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double SlotOffsetY { get; set; }
Public Property SlotOffsetY As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
BoltHoleAttributes Class
Tekla.Structures.Model Namespace